package Reverse;

public final class stringStorage {

    public static String[] dayName = {"شنبه", "یکشنبه", "دوشنبه", "سه شنبه", "چهارشنبه", "پنجشنبه", "جمعه"};

    private static String[][] sEvents = {new String[0], new String[]{"عید نوروز", "عید نوروز", "عید نوروز", "عید نوروز", "روز جمهوری اسلامی ایران", "روز طبیعت", "روز ملی فناوری هسته ای", "روز بزرگداشت عطار نیشابوری", "روز ارتش"}, new String[]{"روز بزرگداشت سعدی", "روز زمین پاک", "روز بزرگداشت شیخ بهایی", "شکست حمله آمریکا در طبس", "روز شوراها", "روز ملی خلیج فارس", "شهادت استاد مطهری", "روز معلم", "روز اسناد ملی", "لغو امتیاز تنباکو", "روز بزرگداشت فردوسی", "روز ارتباطات و روابط عمومی", "روز بزرگداشت حکیم عمر خیام"}, new String[]{"روز بزرگداشت ملاصدرا", "روز بهینه سازی مصرف", "سالروز فتح خرمشهر", "سالروز رحلت امام خمینی(ره)", "سالروز قیام خونین 15 خرداد", "روز گل و گیاه", "روز جهاد کشاورزی", "درگذشت دکتر علی شریعتی", "شهادت دکتر مصطفی چمران"}, new String[]{"روز اصناف", "شهادت دکتر بهشتی", "روز قوه قضاییه", "روز صنعت و معدن", "سرنگونی هواپیمای مسافری ایران", "توسط ناو آمریکایی", "روز قلم", "روز مالیات", "روز بهزیستی و تامین اجتماعی"}, new String[]{"روز اهدای خون", "سالروز صدور فرمان مشروطیت", "روزخبرنگار", "سالروز کودتای 28 مرداد", "روز بزرگداشت علامه مجلسی"}, new String[]{"روز بزرگداشت ابن سینا", "روز پزشک", "اشغال ایران توسط متفقین", "روز کارمند", "روز بزرگداشت زکریای رازی", "روز دارو سازی", "روز بانکداری اسلامی", "روز صنعت چاپ", "روز بزرگداشت ابوریحان بیرونی", "روز تعاون", "قیام خونین 17 شهریور 57", "روز سینما", "روز شعر و ادب فارسی", "روز بزرگداشت استاد شهریار", "روز گفتگوی تمدن ها", "سالروز آغاز جنگ تحمیلی"}, new String[]{"روز آتشنشانی و ایمنی", "روز بزرگداشت مولانا", "روز نیروی انتظامی", "مهاجرت امام خمینی(ره) از عراق", "به پاریس", "روز دامپزشکی", "روز بزرگداشت حافظ", "روز تربیت بدنی و ورزش", "روز صادرات"}, new String[]{"روز آمار و برنامه ریزی", "روز نوجوان", "روز دانش آموز", "روز فرهنگ عمومی", "روز ملی کیفیت", "روز کتاب و کتابخوانی"}, new String[]{"روز نیروی دریایی", "روز بیمه", "روز دانشجو", "روز پژوهش", "روز حمل و نقل", "شب یلدا"}, new String[]{"روز ملی ایمنی در برابر زلزله", "روز جهاد کشاورزی", "روز خانواده", "شهادت میرزا تقی خان امیرکبیر", "فرار شاه از ایران"}, new String[]{"بازگشت امام خمینی به ایران", "آغاز دهه فجر", "روز نیروی هوایی", "پیروزی انقلاب اسلامی ایران"}, new String[]{"روز بزرگداشت خواجه نصیرالدین", "طوسی", "روز مهندسی", "روز احسان و نیکوکاری", "روز درختکاری", "روز بزرگداشت پروین اعتصامی", "روز ملی شدن صنعت نفت"}};

    public static String[] monthsName = {"فروردین", "اردیبهشت", "خرداد", "تیر", "مرداد", "شهریور", "مهر", "آبان", "آذر", "دی", "بهمن", "اسفند"};

    private static String[][] gEvents = {new String[0], 
        new String[]{"تاسوعای حسینی", "عاشورای حسینی",
            "شهادت امام زین العابدین(ع)"},
        new String[]{"ولادت امام موسی کاظم(ع)",
            "اربعین حسینی", "رحلت رسول اکرم(ص)",
            "شهادت امام حسن مجتبی(ع)", "شهادت امام رضا(ع)"},
        new String[]{"شهادت امام حسن عسگری(ع)", "میلاد حضرت محمد(ص) ", "به روایت اهل سنت", "آغاز هفته وحدت", "میلاد حضرت محمد(ص)", "میلاد امام جعفر صادق(ع)"},
        new String[]{"ولادت امام حسن عسگری(ع)", "وفات حضرت معصومه(س)"},
        new String[]{"ولادت حضرت زینب(س)", "روز پرستار", "شهادت حضرت فاطمه(س) به", "روایتی"},
        new String[]{"شهادت حضرت فاطمه(س)", "ولادت حضرت فاطمه(س)", "روز مادر"},
        new String[]{"ولادت امام محمد باقر(ع)", "شهادت امام علی النقی(ع)",
            "ولادت امام محمد تقی(ع)", "ولادت حضرت علی(ع)", "وفات حضرت زینب(س)", "تغییر قبله مسلمانان از", "بیت المقدس به مکه مکرمه", "شهادت امام موسی کاظم(ع)", "عید مبعث"},
        new String[]{"ولادت امام حسین(ع)", "روز پاسدار", "ولادت حضرت ابولفضل عباس(ع)", "روز جانباز", "ولادت امام زین العابدین(ع)", "ولادت حضرت علی اکبر(ع)", "روز جوان", "ولادت حضرت مهدی(عج)", "روز جهانی مستضعفان"}, 
        new String[]{"وفات حضرت خدیجه(س)", "ولادت امام حسن مجتبی(ع)", "شب قدر", "ضربت خوردن حضرت علی(ع)", "شب قدر", "شهادت حضرت علی(ع)", "شب قدر"},
        new String[]{"عید سعید فطر", "شهادت امام جعفر صادق(ع)"}, 
        new String[]{"ولادت حضرت معصومه(س)", "روز ملی دختران", "ولادت امام رضا(ع)", "شهادت امام محمد تقی(ع)"},
        new String[]{"روز ازدواج", "شهادت امام محمد باقر(ع)", "روز عرفه", "عید سعید قربان", "ولادت امام علی النقی(ع)", "عید سعید غدیر خم"}};

    
    public static String[] gmonthsName = {"محرم", "صفر", "ربیع الاول", "ربیع الثانی", "جمادی الاول", "جمادی الثانی", "رجب", "شعبان", "رمضان", "شوال", "ذی القعده", "ذی الحجه"};

    private static String[][] mEvents = {new String[0], new String[0], new String[0], new String[]{"روز جهانی آب", "روز جهانی هواشناسی"}, new String[]{"روز جهانی بهداشت"}, new String[]{"روز جهانی کار و کارگر", "روز جهانی صلیب سرخ و", "هلال احمر", "روز جهانی موزه و میراث فرهنگی", "روز جهانی بدون دخانیات"}, new String[]{"روز جهانی محیط زیست", "روز جهانی صنایع دستی", "روز جهانی بیابان زدایی", "روز جهانی مبارزه با مواد مخدر"}, new String[0], new String[]{"روز جهانی شیر مادر", "روز جهانی مسجد"}, new String[]{"روز جهانی جهانگردی", "روز جهانی ناشنوایان", "روز جهانی دریانوردی"}, new String[]{"روز جهانی سالمندان", "روز جهانی کودک", "روز جهانی پست", "روز جهانی استاندارد", "روز جهانی نابینایان", "روز جهانی غذا"}, new String[0], new String[]{"روز جهانی مبارزه با ایدز", "روز جهانی معلولان", "روز جهانی هواپیمایی"}};

    public static String[] mmonthsName = {"January", "February", "March", "April", "May", "June", "July", "August", "September", "October", "November", "December"};

    public static String[] getShamsiEvents(int month, int day, int count) {
        int offset = 0;
        String[] result = new String[count];
        int i = 0;
        while (i < EventGraphicsManager.sEvents[month].length && EventGraphicsManager.sEvents[month][i] / 10 != day) {
            offset += EventGraphicsManager.sEvents[month][i] % 10;
            i++;
        }
        for (int i2 = 0; i2 < count; i2++) {
            try {
                result[i2] = sEvents[month][offset + i2];
            } catch (ArrayIndexOutOfBoundsException e) {
                result[i2] = "اشکال در داده ها";
            }
        }
        return result;
    }

    public static String[] getGhamariEvents(int month, int day, int count) {
        int offset = 0;
        String[] result = new String[count];
        int i = 0;
        while (i < EventGraphicsManager.gEvents[month].length && EventGraphicsManager.gEvents[month][i] / 10 != day) {
            offset += EventGraphicsManager.gEvents[month][i] % 10;
            i++;
        }
        for (int i2 = 0; i2 < count; i2++) {
            try {
                result[i2] = gEvents[month][offset + i2];
            } catch (ArrayIndexOutOfBoundsException e) {
                result[i2] = "اشکال در داده ها(قمری)";
            }
        }
        return result;
    }

    public static String[] getMiladiEvents(int month, int day, int count) {
        int offset = 0;
        String[] result = new String[count];
        int i = 0;
        while (i < EventGraphicsManager.mEvents[month].length && EventGraphicsManager.mEvents[month][i] / 10 != day) {
            offset += EventGraphicsManager.mEvents[month][i] % 10;
            i++;
        }
        for (int i2 = 0; i2 < count; i2++) {
            try {
                result[i2] = mEvents[month][offset + i2];
            } catch (ArrayIndexOutOfBoundsException e) {
                result[i2] = "اشکال در داده ها(میلادی)";
            }
        }
        return result;
    }

}
